[
  {
    "id": 1,
    "title": "Interstellar",
    "category": "movie",
    "year": 2014,
    "director": "Christopher Nolan",
    "image": "img/interstellar.jpg",
    "description": "Dünya yaşanmaz bir hale geldiğinde, bir grup astronot insanlığın hayatta kalabilmesi için uzaydaki bir solucan deliğinden geçerek yeni bir yaşanabilir gezegen arayışına girer. Zamanın ve mekanın sınırlarını zorlayan bu yolculukta babalık bağı ve fedakarlık temaları işlenir.",
    "cast": "Matthew McConaughey, Anne Hathaway, Jessica Chastain, Matt Damon, Michael Caine, Casey Affleck",
    "rating": 8.7
  },
  {
    "id": 2,
    "title": "The Dark Knight",
    "category": "movie",
    "year": 2008,
    "director": "Christopher Nolan",
    "image": "img/thedarknight.jpg",
    "description": "Batman, bölge savcısı Harvey Dent ve Teğmen Jim Gordon ile birlikte Gotham Şehri'ndeki organize suçu tamamen temizlemek için bir plan yapar. Ancak karşılarına zekasıyla kaosu yöneten ve Batman'i ahlaki bir ikileme sürükleyen Joker çıkar.",
    "cast": "Christian Bale, Heath Ledger, Aaron Eckhart, Michael Caine, Maggie Gyllenhaal, Gary Oldman, Morgan Freeman",
    "rating": 9.0
  },
  {
    "id": 3,
    "title": "Oppenheimer",
    "category": "movie",
    "year": 2023,
    "director": "Christopher Nolan",
    "image": "img/oppenheimer.jpg",
    "description": "Teorik fizikçi J. Robert Oppenheimer'ın, İkinci Dünya Savaşı sırasında dünyayı yok etme riskini göze alarak atom bombasını geliştirdiği 'Manhattan Projesi'ndeki rolünü ve sonrasındaki etik vicdan azabını konu alan biyografik başyapıt.",
    "cast": "Cillian Murphy, Emily Blunt, Matt Damon, Robert Downey Jr., Florence Pugh, Josh Hartnett, Casey Affleck",
    "rating": 8.4
  },
  {
    "id": 4,
    "title": "Inception",
    "category": "movie",
    "year": 2010,
    "director": "Christopher Nolan",
    "image": "img/inception.jpg",
    "description": "Dom Cobb, insanların zihinlerinin en savunmasız olduğu rüya görme anında, bilinçaltının derinliklerinden değerli sırları çalma konusunda uzmanlaşmış bir hırsızdır. Ancak bu sefer görevi çalmak değil, bir fikri zihne yerleştirmektir.",
    "cast": "Leonardo DiCaprio, Joseph Gordon-Levitt, Elliot Page, Tom Hardy, Ken Watanabe, Cillian Murphy, Marion Cotillard",
    "rating": 8.8
  },
  {
    "id": 5,
    "title": "The Odyssey",
    "category": "movie",
    "year": 2026,
    "director": "Christopher Nolan",
    "image": "img/theodyssey.jpg",
    "description": "Nolan'ın gelecekteki projeleri arasında anılan, konusu sır gibi saklanan ancak havacılık veya casusluk temalı olacağı fısıldanan, sinema dünyasında büyük merak uyandıran yeni nesil yapımı.",
    "cast": "Henüz Açıklanmadı (Dedikodular: Matt Damon, Tom Holland)",
    "rating": 0.0
  },
  {
    "id": 6,
    "title": "Tenet",
    "category": "movie",
    "year": 2020,
    "director": "Christopher Nolan",
    "image": "img/tenet.jpg",
    "description": "Dünyayı büyük bir felaketten kurtarmak için zamana karşı yarışan bir ajanın hikayesi. 'Evrilme' adı verilen teknoloji sayesinde zamanın akışını tersine çevirebilen kahramanımız, Üçüncü Dünya Savaşı'ndan daha büyük bir tehdidi durdurmaya çalışır.",
    "cast": "John David Washington, Robert Pattinson, Elizabeth Debicki, Kenneth Branagh, Aaron Taylor-Johnson, Michael Caine",
    "rating": 7.3
  },
  {
    "id": 7,
    "title": "Memento",
    "category": "movie",
    "year": 2000,
    "director": "Christopher Nolan",
    "image": "img/memento.jpg",
    "description": "Kısa süreli hafıza kaybı yaşayan Leonard Shelby, karısının katilini bulmaya çalışır. Hafızası her on beş dakikada bir sıfırlandığı için, hayatını notlar, fotoğraflar ve vücuduna yaptırdığı dövmelerle yönetmek zorundadır.",
    "cast": "Guy Pearce, Carrie-Anne Moss, Joe Pantoliano, Mark Boone Junior, Russ Fega",
    "rating": 8.4
  },
  {
    "id": 8,
    "title": "Dunkirk",
    "category": "movie",
    "year": 2017,
    "director": "Christopher Nolan",
    "image": "img/dunkirk.jpg",
    "description": "İkinci Dünya Savaşı'nın kaderini değiştiren Dunkerque tahliyesini; karadan, denizden ve havadan olmak üzere üç farklı zaman diliminde anlatan, diyalogdan ziyade atmosfer ve gerilime odaklanan epik savaş filmi.",
    "cast": "Fionn Whitehead, Tom Hardy, Cillian Murphy, Mark Rylance, Kenneth Branagh, Harry Styles, Barry Keoghan",
    "rating": 7.8
  },
  {
    "id": 9,
    "title": "The Dark Knight Rises",
    "category": "movie",
    "year": 2012,
    "director": "Christopher Nolan",
    "image": "img/thedark.jpg",
    "description": "Joker'in yarattığı yıkımdan sekiz yıl sonra, Gotham yeni bir tehditle karşı karşıyadır: Bane. Batman, şehri korumak için inzivasından dönmek ve fiziksel olduğu kadar zihinsel bir yıkımla da yüzleşmek zorundadır.",
    "cast": "Christian Bale, Tom Hardy, Anne Hathaway, Marion Cotillard, Joseph Gordon-Levitt, Michael Caine, Gary Oldman",
    "rating": 8.4
  },
  {
    "id": 10,
    "title": "Batman Begins",
    "category": "movie",
    "year": 2005,
    "director": "Christopher Nolan",
    "image": "img/batman.jpg",
    "description": "Bruce Wayne'in ailesinin katledilmesinin ardından yaşadığı travmayı, Uzak Doğu'da aldığı eğitimi ve Gotham'ın çürümüş düzenine karşı 'Batman' kimliğini ilk kez nasıl inşa ettiğini anlatan başlangıç hikayesi.",
    "cast": "Christian Bale, Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Cillian Murphy, Morgan Freeman",
    "rating": 8.2
  },
  {
    "id": 11,
    "title": "The Prestige",
    "category": "movie",
    "year": 2006,
    "director": "Christopher Nolan",
    "image": "img/theprestige.jpg",
    "description": "19. yüzyıl Londra'sında iki rakip sihirbazın, birbirlerinin en büyük numarasını çözmek ve birbirlerini alt etmek için girdikleri, trajedilere ve karanlık sırlara yol açan takıntılı ve amansız rekabeti.",
    "cast": "Hugh Jackman, Christian Bale, Scarlett Johansson, Michael Caine, David Bowie, Andy Serkis, Rebecca Hall",
    "rating": 8.5
  },
  {
    "id": 12,
    "title": "Insomnia",
    "category": "movie",
    "year": 2002,
    "director": "Christopher Nolan",
    "image": "img/insomnia.jpg",
    "description": "Almanya'nın küçük bir kasabasında işlenen bir cinayeti soruşturmakla görevli deneyimli dedektif Will Dormer, bölgedeki hiç batmayan güneşin yarattığı uykusuzlukla boğuşurken, katille girdiği psikolojik oyunda kendi vicdanıyla yüzleşir.",
    "cast": "Al Pacino, Robin Williams, Hilary Swank, Maura Tierney, Martin Donovan, Nicky Katt",
    "rating": 7.2
  },
  {
    "id": 13,
    "title": "The Walking Dead",
    "category": "series",
    "year": 2010,
    "director": "Frank Darabont (Yaratıcı)",
    "image": "img/thewalkingdead.jpg",
    "description": "Şerif yardımcısı Rick Grimes, bir hastanede komadan uyandığında dünyanın zombiler tarafından ele geçirildiğini görür. Ailesini bulmak ve güvenli bir yer inşa etmek için hayatta kalan bir gruba liderlik ederken, asıl tehlikenin zombiler değil insanlar olduğunu anlar.",
    "cast": "Andrew Lincoln, Norman Reedus, Melissa McBride, Lauren Cohan, Jeffrey Dean Morgan, Steven Yeun, Danai Gurira",
    "rating": 8.1
  },
  {
    "id": 14,
    "title": "Skins",
    "category": "series",
    "year": 2007,
    "director": "Bryan Elsley, Jamie Brittain",
    "image": "img/skins.jpg",
    "description": "Bristol'da yaşayan bir grup gencin hayatına odaklanan dizi; madde bağımlılığı, cinsellik, yeme bozuklukları ve ailevi sorunlar gibi gençlik dönemi sancılarını sansürsüz ve cesur bir dille ekrana taşıyor.",
    "cast": "Kaya Scodelario, Nicholas Hoult, Joe Dempsie, Hannah Murray, Jack O'Connell, Dev Patel, April Pearson",
    "rating": 8.2
  },
  {
    "id": 15,
    "title": "Community",
    "category": "series",
    "year": 2009,
    "director": "Dan Harmon (Yaratıcı)",
    "image": "img/community.jpg",
    "description": "Diploması geçersiz sayılan bir avukatın, sahte bir İspanyolca çalışma grubu kurmasıyla bir araya gelen birbirinden tamamen farklı yedi kişinin Greendale Community College'daki absürt ve popüler kültür göndermeleriyle dolu maceraları.",
    "cast": "Joel McHale, Danny Pudi, Donald Glover, Alison Brie, Gillian Jacobs, Yvette Nicole Brown, Chevy Chase, Ken Jeong",
    "rating": 8.5
  },
  {
    "id": 16,
    "title": "Alice in Borderland",
    "category": "series",
    "year": 2020,
    "director": "Shinsuke Sato",
    "image": "img/aliceinborderland.jpg",
    "description": "Oyun bağımlısı bir genç ve arkadaşları kendilerini terk edilmiş bir Tokyo'da bulur. Hayatta kalabilmek için türü ve zorluğu oyun kartlarıyla belirlenen tehlikeli ve ölümcül oyunlarda yarışmak zorundadırlar.",
    "cast": "Kento Yamazaki, Tao Tsuchiya, Nijiro Murakami, Ayaka Miyoshi, Dori Sakurada, Aya Asahina",
    "rating": 7.7
  },
  {
    "id": 17,
    "title": "Behzat Ç.",
    "category": "series",
    "year": 2010,
    "director": "Serdar Akar, Doğan Ümit Karaca",
    "image": "img/behzatç.jpg",
    "description": "Ankara Cinayet Büro'da görevli, kurallara uymayan ve amirleriyle sürekli çatışan bir başkomiserin hikayesi. Behzat Ç., ekibiyle birlikte karmaşık cinayetleri çözerken bir yandan da geçmişindeki travmalar ve sistemin yozlaşmış yapısıyla mücadele eder.",
    "cast": "Erdal Beşikçioğlu, İnanç Konukçu, Fatih Artman, Berkan Şal, Ege Aydan, Canan Ergüder, Ayça Eren, Erkan Can",
    "rating": 8.9
  },
  {
    "id": 18,
    "title": "Poyraz Karayel",
    "category": "series",
    "year": 2015,
    "director": "Çağrı Vila Lostuvalı",
    "image": "img/poyrazkarayel.jpg",
    "description": "Her şeyini kaybetmiş eski bir polisin, oğlunu geri alabilmek için mafyanın içine sızmasını ve bu süreçte mafya babasının kızı Ayşegül ile yaşadığı imkansız aşkı konu alan, dram ve absürt mizahın iç içe geçtiği efsanevi dizi.",
    "cast": "İlker Kaleli, Burçin Terzioğlu, Musa Uzunlar, Celil Nalçakan, Hare Sürel, Ali İl, Ece Özdikici, Kanbolat Görkem Arslan",
    "rating": 8.3
  },
  {
    "id": 19,
    "title": "Saygı",
    "category": "series",
    "year": 2020,
    "director": "Ali Taner Baltacı",
    "image": "img/saygı.jpg",
    "description": "Behzat Ç. evreninden tanıdığımız Ercüment Çözer, toplumdaki 'saygısızlık' sorununa kendi radikal ve vahşi yöntemleriyle çözüm bulmaya çalışır. Bu yolda onunla benzer adalet duygusuna sahip iki gençle yolları kesişir.",
    "cast": "Nejat İşler, Boran Kuzum, Miray Daner, Erkan Can, Tansu Biçer, Rojda Demirer",
    "rating": 7.8
  },
  {
    "id": 20,
    "title": "Kinyas ve Kayra",
    "category": "book",
    "year": 2000,
    "director": "Yazar: Hakan Günday",
    "image": "img/kinyas.jpg",
    "description": "İki arkadaşın Afrika'dan Amerika'ya, oradan Türkiye'ye uzanan, şiddet, uyuşturucu ve varoluşsal sancılarla dolu yolculuğu. Modern edebiyatın en sert ve etkileyici yeraltı eserlerinden biri olan kitap, insan doğasının karanlık taraflarını ve hiçliği sorgular.",
    "cast": "Yazar: Hakan Günday",
    "rating": 4.9
  },
  {
    "id": 21,
    "title": "Azil",
    "category": "book",
    "year": 2007,
    "director": "Yazar: Hakan Günday",
    "image": "img/azil.jpg",
    "description": "Zeka, delilik ve toplum üzerine sert bir Hakan Günday romanı. Kendini 'asıl' olandan sürgün edilmiş hisseden bir karakterin, toplumun dayattığı normlara ve kendi zihninin dehlizlerine karşı verdiği mücadele.",
    "cast": "Yazar: Hakan Günday",
    "rating": 4.7
  },
  {
    "id": 22,
    "title": "Daha",
    "category": "book",
    "year": 2013,
    "director": "Yazar: Hakan Günday",
    "image": "img/daha.jpg",
    "description": "İnsan kaçakçılığı yapan bir babanın yanında büyüyen Gaza'nın, masumiyetini kaybederek bir suç ortağına dönüşme sürecini ve Ege kıyılarındaki trajik mülteci dramını sarsıcı bir dille anlatan roman.",
    "cast": "Yazar: Hakan Günday",
    "rating": 4.8
  },
  {
    "id": 23,
    "title": "Zargana",
    "category": "book",
    "year": 2002,
    "director": "Yazar: Hakan Günday",
    "image": "img/zargana.jpg",
    "description": "Hakan Günday'ın erken dönem eserlerinden olan kitap, on iki yaşında bir çocuğun travmatik bir olay sonrası sessizliğe gömülüşünü ve yıllar sonra geri dönüşündeki intikam dolu hikayesini anlatır.",
    "cast": "Yazar: Hakan Günday",
    "rating": 4.6
  },
  {
    "id": 24,
    "title": "Malafa",
    "category": "book",
    "year": 2005,
    "director": "Yazar: Hakan Günday",
    "image": "img/malafa.jpg",
    "description": "Hakan Günday'ın turizm sektörünün arka bahçesini; tezgahtarların, kuyumcuların ve turistlerin arasındaki yozlaşmış ilişkileri, sert ve gerçekçi bir üslupla kaleme aldığı romanı.",
    "cast": "Yazar: Hakan Günday",
    "rating": 4.3
  },
  {
    "id": 25,
    "title": "Dorian Gray'in Portresi",
    "category": "book",
    "year": 1890,
    "director": "Yazar: Oscar Wilde",
    "image": "img/dorian.jpg",
    "description": "Sonsuz gençlik dileyen Dorian Gray'in yerine tablosunun yaşlanmasını ve işlediği günahların izlerini taşımasını konu alan, estetik ve ahlak üzerine yazılmış sarsıcı bir başyapıt.",
    "cast": "Yazar: Oscar Wilde",
    "rating": 4.5
  },
  {
    "id": 26,
    "title": "Fight Club",
    "category": "book",
    "year": 1996,
    "director": "Yazar: Chuck Palahniuk",
    "image": "img/fightclub.jpg",
    "description": "Tüketim kültürüne, modern yaşamın tekdüzeliğine ve toplumsal maskelere karşı radikal bir başkaldırı hikayesi. Tyler Durden karakteriyle kaosu ve özgürlüğü sorgulayan kült eser.",
    "cast": "Yazar: Chuck Palahniuk",
    "rating": 4.7
  },
  {
    "id": 27,
    "title": "Fahrenheit 451",
    "category": "book",
    "year": 1953,
    "director": "Yazar: Ray Bradbury",
    "image": "img/fahrenheit451.jpg",
    "description": "Kitapların yasaklandığı ve itfaiyecilerin yangın söndürmek yerine kitap yaktığı distopik bir gelecek. Bilginin sansürlendiği bir toplumda Guy Montag'ın uyanış hikayesi.",
    "cast": "Yazar: Ray Bradbury",
    "rating": 4.4
  },
  {
    "id": 28,
    "title": "Succession",
    "category": "series",
    "year": 2018,
    "director": "Jesse Armstrong (Yaratıcı)",
    "image": "img/succesion.jpg",
    "description": "Dünyanın en büyük medya ve eğlence imparatorluklarından birini yöneten Logan Roy'un sağlığı bozulduğunda, dört çocuğunun şirketin kontrolünü ele geçirmek için girdikleri kirli ve amansız mücadele.",
    "cast": "Brian Cox, Jeremy Strong, Sarah Snook, Kieran Culkin, Alan Ruck, Matthew Macfadyen, Nicholas Braun",
    "rating": 8.9
  },
  {
    "id": 29,
    "title": "Breaking Bad",
    "category": "series",
    "year": 2008,
    "director": "Vince Gilligan (Yaratıcı)",
    "image": "img/breakingbad.jpg",
    "description": "Kanser olduğunu öğrenen sıradan bir kimya öğretmeninin, ailesinin geleceğini garanti altına almak için eski bir öğrencisiyle birlikte uyuşturucu üretimine girmesini ve adım adım bir suç dehasına dönüşmesini konu alan kült dizi.",
    "cast": "Bryan Cranston, Aaron Paul, Anna Gunn, Giancarlo Esposito, Jonathan Banks, Dean Norris, Bob Odenkirk",
    "rating": 9.5
  },
  {
    "id": 30,
    "title": "Following",
    "category": "movie",
    "year": 1998,
    "director": "Christopher Nolan",
    "image": "img/following.jpg",
    "description": "Nolan'ın ilk uzun metrajlı, siyah-beyaz gerilim filmi. Yeni romanı için malzeme arayan işsiz bir yazarın, sokaktaki yabancıları takip etmeye başlamasıyla içine çekildiği suç dolu karanlık dünyayı anlatır.",
    "cast": "Jeremy Theobald, Alex Haw, Lucy Russell, John Nolan, Dick Bradsell",
    "rating": 7.5
  }
]